# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 custom (yolo8_goldacsim + FDM-YOLO Fast-C2f + P2 Small Object Detection + SimAM Attention)

nc: 5 # number of classes
scales: 
  m: [0.67, 0.75, 768] 

# ========================================================
# BACKBONE: Trích xuất đặc trưng cơ sở (Giữ nguyên)
# ========================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2  (Đầu ra P2_Backbone - Giữ lại để dùng cho nhánh P2)
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4  (Đầu ra P3_Backbone)
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6  (Đầu ra P4_Backbone)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8  (Đầu ra P5_Backbone)
  - [-1, 1, SimSPPF, [1024, 5]] # 9  (Đầu ra P5_Backbone sau khi qua SPPF)

# ========================================================
# NECK ĐƯỢC CẢI TIẾN: Lọc và hợp nhất đặc trưng (Bỏ P5, Thêm P2)
# ========================================================
head:
  # --- Tiền xử lý hợp nhất Goldacsim ---
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]]             # 11

  # --- Xử lý trung gian ---
  - [9, 1, Conv, [512, 1, 1]]                                      # 12
  - [[4, 6, -1], 1, SimFusion_3in, [512]]                          # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 14
  - [-1, 3, Fast_C2f, [512, False]]                                # 15 

  # ========================================================
  # [NHÁNH P3] - CHUYÊN NHẬN DIỆN VẬT THỂ KÍCH THƯỚC VỪA (Stride = 8)
  # ========================================================
  - [6, 1, Conv, [256, 1, 1]]                                      # 16
  - [[2, 4, -1], 1, SimFusion_3in, [256]]                          # 17
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 18
  - [-1, 3, Fast_C2f, [256, False]]                                # 19 -> (CHỐT ĐẦU RA NHÁNH P3)

  # ========================================================
  # [NHÁNH P4] - CHUYÊN NHẬN DIỆN VẬT THỂ KÍCH THƯỚC LỚN (Stride = 16)
  # ========================================================
  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]]                     # 20
  - [-1, 1, TopBasicLayer, [352, [64, 128]]]                       # 21
  - [[19, 16], 1, AdvPoolFusion, []]                               # 22
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 23
  - [-1, 3, Fast_C2f, [256, False]]                                # 24 -> (CHỐT ĐẦU RA NHÁNH P4)

  # ========================================================
  # [NHÁNH P2 TẠO MỚI] - CHUYÊN TRỊ VẬT THỂ CỰC NHỎ (Stride = 4)
  # Nhận tín hiệu từ P3 phóng to lên và ghép với P2 của Backbone
  # ========================================================
  - [19, 1, nn.Upsample, [None, 2, 'nearest']]                     # 25: Phóng to (Upsample) đặc trưng từ nhánh P3
  - [[-1, 2], 1, Concat, [1]]                                      # 26: Ghép nối (Concat) P3 đã phóng to với P2 từ Backbone
  - [-1, 3, Fast_C2f, [128, False]]                                # 27 -> (CHỐT ĐẦU RA NHÁNH P2)
  
  # ========================================================
  # MODULE CẢI TIẾN: SimAM (Simple, Parameter-Free Attention Module)
  # Thay thế EMA bằng SimAM để đánh trọng số 3D mà không tốn thêm tham số
  # ========================================================
  - [27, 1, SimAM, []] # 28 (Cơ chế chú ý SimAM cho nhánh P2 - Vật thể nhỏ)
  - [19, 1, SimAM, []] # 29 (Cơ chế chú ý SimAM cho nhánh P3 - Vật thể vừa)
  - [24, 1, SimAM, []] # 30 (Cơ chế chú ý SimAM cho nhánh P4 - Vật thể lớn)

  # ========================================================
  # LỚP PHÂN LOẠI VÀ ĐỊNH VỊ (DETECT HEAD)
  # ========================================================
  - [[28, 29, 30], 1, Detect, [nc]] # 31: Layer Detect tổng hợp kết quả từ P2, P3, P4