# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 custom (yolo8_goldacsim + FDM-YOLO Fast-C2f & EMA)

# Parameters
nc: 80 # number of classes
scales: 
  m: [0.67, 0.75, 768] 

# YOLOv8.0n backbone (Giữ nguyên không dùng Fast_C2f để bảo toàn đặc trưng)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SimSPPF, [1024, 5]] # 9

# FDM-YOLO x Goldacsim head
head:
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]] # 11

  - [9, 1, Conv, [512, 1, 1]] # 12
  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 14
  # Thay thế C3Ghost bằng Fast_C2f (Cải tiến từ bài báo)
  - [-1, 3, Fast_C2f, [512, False]] # 15 

  - [6, 1, Conv, [256, 1, 1]] # 16
  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 17
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 18
  # Thay thế C3Ghost bằng Fast_C2f
  - [-1, 3, Fast_C2f, [256, False]] # 19 

  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]] # 20
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 21

  - [[19, 16], 1, AdvPoolFusion, []] # 22
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 23
  # Thay thế C3Ghost bằng Fast_C2f
  - [-1, 3, Fast_C2f, [256, False]] # 24 

  - [[-1, 12], 1, AdvPoolFusion, []] # 25
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]] # 26
  # Thay thế C2f bằng Fast_C2f
  - [-1, 3, Fast_C2f, [512, False]] # 27 

  # Thêm cơ chế EMA Attention ngay trước Detect Head
  - [19, 1, EMA, []] # 28 (Nhánh P3)
  - [24, 1, EMA, []] # 29 (Nhánh P4)
  - [27, 1, EMA, []] # 30 (Nhánh P5)

  # Đưa các đầu ra đã qua xử lý EMA vào lớp Detect
  - [[28, 29, 30], 1, Detect, [nc]] # 31 Detect(P3, P4, P5)