# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO-APD1 Custom Model (Goldacsim + Fast-C2f + P2 Small Object + SimAM + Tucker Decomposition)

nc: 5 # Số lượng class huấn luyện (Tập dữ liệu KITTI)
scales: 
  m: [0.67, 0.75, 768] 

# ========================================================
# BACKBONE NÉN TUCKER
# ========================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2 
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4 
  - [-1, 3, C2f, [128, True]]              # 2  (P2_Backbone)
  
  - [-1, 1, TuckerConv, [256, 3, 2, 0.5]]  # 3-P3/8  (Đã nén Tucker)
  - [-1, 6, C2f, [256, True]]              # 4  
  
  - [-1, 1, TuckerConv, [512, 3, 2, 0.5]]  # 5-P4/16 (Đã nén Tucker)
  - [-1, 6, C2f, [512, True]]              # 6  
  
  - [-1, 1, TuckerConv, [1024, 3, 2, 0.5]] # 7-P5/32 (Đã nén Tucker)
  - [-1, 3, C2f, [1024, True]]             # 8  
  - [-1, 1, SimSPPF, [1024, 5]]            # 9  

# ========================================================
# HEAD & NECK 
# ========================================================
head:
  - [[2, 4, 6, 9], 1, SimFusion_4in, []]   # 10
  - [-1, 1, IFM, [[64, 32]]]               # 11

  - [9, 1, Conv, [512, 1, 1]]                                      # 12
  - [[4, 6, -1], 1, SimFusion_3in, [512]]                          # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 14
  - [-1, 3, Fast_C2f, [512, False]]                                # 15 

  # [NHÁNH P3] 
  - [6, 1, Conv, [256, 1, 1]]                                      # 16
  - [[2, 4, -1], 1, SimFusion_3in, [256]]                          # 17
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 18
  - [-1, 3, Fast_C2f, [256, False]]                                # 19 -> P3

  # [NHÁNH P4] 
  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]]                     # 20
  - [-1, 1, TopBasicLayer, [352, [64, 128]]]                       # 21
  - [[19, 16], 1, AdvPoolFusion, []]                               # 22
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 23
  - [-1, 3, Fast_C2f, [256, False]]                                # 24 -> P4

  # [NHÁNH P2 TẠO MỚI] 
  - [19, 1, nn.Upsample, [None, 2, 'nearest']]                     # 25
  - [[-1, 2], 1, Concat, [1]]                                      # 26: Ghép với layer 2
  - [-1, 3, Fast_C2f, [128, False]]                                # 27 -> P2

  # KHỐI CHÚ Ý TẬP TRUNG SIMAM
  - [27, 1, SimAM, []] # 28 (Nhánh P2)
  - [19, 1, SimAM, []] # 29 (Nhánh P3)
  - [24, 1, SimAM, []] # 30 (Nhánh P4)

  # ĐẦU RA MÔ HÌNH (DETECT HEAD)
  - [[28, 29, 30], 1, Detect, [nc]] # 31: Dự đoán trên P2, P3, P4